Feature:  Вход в системата на потребител
 
 Scenario Outline: Вход в системата
    Given Потребителя отваря екрана за вход
    And Отваря се форма за вход в системата
    When Въвежда валидно потребителско име "<username>"
    And Въвежда валидна парола "<password>"
    And Натиска бутона за вход в системата
    Then Вижда съобщение  "<message>"
    
  Examples:
  | username | password  |message                                  |
  | Petranka | adminpass |Успешно влезнахте в акаунта си!          |
  | Petranka | admin     |Моля въведете правилна парола!           |
  | Ivanka   | adminpass |Моля въведете правилно потребителско име!|
  | Petranka |           |Моля въведете парола!                    |
  |          | adminpass |Моля въведете потребителско име!         |
  |          |           |Моля въведете потребителско име и парола!| 