  Feature: Запазване на час за зъболекар по телефон
  
    Scenario Outline: Запазване на час за зъболекар по телефон
    Given Потребителя звъни на рецепцията за запазване на час
    And Отваря се телефона от рецепцията
    When Избира някои от предоставените свободни дати и часове  "<date>"
    And Казва оплакване за зъбобол "<name>"
    Then Чува съобщение "<message>"

 Examples: 
	|date            |name              |message                   |
    |09.02.2021 10:30|Проблем с венците | Успешно си запазихте час!|
    |                |Проблем с венците | Моля изберете дата и час!|
	|09.02.2021 10:30|      	        | Моля кажете оплакване!   |
	|                |                  | Моля въведете данни!     |